wosayttn/M55M1BSP/Library/StdDriver/src/sdh.c
        for (i = 0ul; i < 4ul; i++)
        {
            puR2ptr[i] = ((tmpBuf[i] & 0x00fffffful) << 8) | ((tmpBuf[i + 1ul] & 0xff000000ul) >> 24);
        }
    }
    else
    {
        return SDH_CRC7_ERROR;
    }

    return Successful;
}


uint32_t SDH_SDCmdAndRspDataIn(SDH_T *sdh, uint32_t ucCmd, uint32_t uArg)
{
    volatile uint32_t buf;
    SDH_INFO_T *pSD;
    uint32_t u32TimeOutCount;

    g_SDH_i32ErrCode = 0;

    if (sdh == SDH0)
    {
        pSD = &SD0;
    }
    else
    {
        pSD = &SD1;
    }

    sdh->CMDARG = uArg;
    buf = (sdh->CTL & (~SDH_CTL_CMDCODE_Msk)) | (ucCmd << 8ul) |
          (SDH_CTL_COEN_Msk | SDH_CTL_RIEN_Msk | SDH_CTL_DIEN_Msk);

    sdh->CTL = buf;

    u32TimeOutCount = SDH_TIMEOUT_CNT;

    while ((sdh->CTL & SDH_CTL_RIEN_Msk) == SDH_CTL_RIEN_Msk)
    {
        if (pSD->IsCardInsert == FALSE)
        {
            return SDH_NO_SD_CARD;
        }

        if (--u32TimeOutCount == 0)
        {
            g_SDH_i32ErrCode = SDH_ERR_TIMEOUT;
            break;
        }
    }

    u32TimeOutCount = SDH_TIMEOUT_CNT;

    while ((sdh->CTL & SDH_CTL_DIEN_Msk) == SDH_CTL_DIEN_Msk)
    {
        if (pSD->IsCardInsert == FALSE)
        {
            return SDH_NO_SD_CARD;
        }

        if (--u32TimeOutCount == 0)
        {
            g_SDH_i32ErrCode = SDH_ERR_TIMEOUT;
            break;
        }
    }

    if ((sdh->INTSTS & SDH_INTSTS_CRC7_Msk) != SDH_INTSTS_CRC7_Msk)
    {
        /* check CRC7 */
        return SDH_CRC7_ERROR;
    }

    if ((sdh->INTSTS & SDH_INTSTS_CRC16_Msk) != SDH_INTSTS_CRC16_Msk)
    {
        /* check CRC16 */
        return SDH_CRC16_ERROR;
    }

    return 0ul;
}

/* there are 8 bits for divider0, maximum is 256 */
#define SDH_CLK_DIV0_MAX     256ul

void SDH_Set_clock(SDH_T *sdh, uint32_t sd_clock_khz)
{
    uint32_t rate, div1;
    static uint32_t u32SD_ClkSrc = 0ul, u32SD_PwrCtl = 0ul;

    uint32_t u32RegLockLevel = SYS_IsRegLocked();

    if (u32RegLockLevel)
    {
        SYS_UnlockReg();
    }

    /* initial state, clock source use HIRC */
    if (sd_clock_khz <= 400ul)
    {
        u32SD_PwrCtl = CLK->SRCCTL;

        if ((u32SD_PwrCtl & CLK_SRCCTL_HIRCEN_Msk) != 0x4ul)
        {
            CLK->SRCCTL |= CLK_SRCCTL_HIRCEN_Msk;
        }

        if (sdh == SDH0)
        {
            u32SD_ClkSrc = (CLK->SDHSEL & CLK_SDHSEL_SDH0SEL_Msk);
            CLK->SDHSEL = (CLK->SDHSEL & ~CLK_SDHSEL_SDH0SEL_Msk) | CLK_SDHSEL_SDH0SEL_HIRC;
            _SDH0_ReferenceClock = (__HIRC / 1000ul);
        }
        else
        {
            u32SD_ClkSrc = (CLK->SDHSEL & CLK_SDHSEL_SDH1SEL_Msk);
            CLK->SDHSEL = (CLK->SDHSEL & ~CLK_SDHSEL_SDH1SEL_Msk) | CLK_SDHSEL_SDH1SEL_HIRC;
            _SDH1_ReferenceClock = (__HIRC / 1000ul);
        }
    }
    /* transfer state, clock source use sys_init() */
    else
    {
        CLK->SRCCTL = u32SD_PwrCtl;

        if (sdh == SDH0)
        {
            CLK->SDHSEL = (CLK->SDHSEL & ~CLK_SDHSEL_SDH0SEL_Msk) | u32SD_ClkSrc;

            switch (u32SD_ClkSrc)
            {
                case CLK_SDHSEL_SDH0SEL_APLL1_DIV2:
                    _SDH0_ReferenceClock = ((CLK_GetAPLL1ClockFreq() >> 1) / 1000ul);
                    break;

                case CLK_SDHSEL_SDH0SEL_HCLK0:
                    _SDH0_ReferenceClock = (CLK_GetHCLK0Freq() / 1000ul);
                    break;

                case CLK_SDHSEL_SDH0SEL_HIRC:
                    _SDH0_ReferenceClock = (__HIRC / 1000ul);
                    break;

                case CLK_SDHSEL_SDH0SEL_HIRC48M_DIV4:
                    _SDH0_ReferenceClock = ((__HIRC48M / 1000ul) / 4);
                    break;

                case CLK_SDHSEL_SDH0SEL_HXT:
                default:
                    _SDH0_ReferenceClock = (CLK_GetHXTFreq() / 1000ul);
                    break;
            }
        }
        else
        {
            CLK->SDHSEL = (CLK->SDHSEL & ~CLK_SDHSEL_SDH1SEL_Msk) | u32SD_ClkSrc;

            switch (u32SD_ClkSrc)
            {
                case CLK_SDHSEL_SDH1SEL_APLL1_DIV2:
                    _SDH1_ReferenceClock = ((CLK_GetAPLL1ClockFreq() >> 1) / 1000ul);
                    break;

                case CLK_SDHSEL_SDH1SEL_HCLK0:
                    _SDH1_ReferenceClock = (CLK_GetHCLK0Freq() / 1000ul);
                    break;

                case CLK_SDHSEL_SDH1SEL_HIRC:
                    _SDH1_ReferenceClock = (__HIRC / 1000ul);
                    break;

                case CLK_SDHSEL_SDH1SEL_HIRC48M_DIV4:
                    _SDH1_ReferenceClock = ((__HIRC48M / 1000ul) / 4);
                    break;

                case CLK_SDHSEL_SDH1SEL_HXT:
                default:
                    _SDH1_ReferenceClock = (CLK_GetHXTFreq() / 1000ul);
                    break;
            }
        }

        if (sd_clock_khz >= 50000ul)
        {
            sd_clock_khz = 50000ul;
        }
    }

    if (sdh == SDH0)
    {
        rate = _SDH0_ReferenceClock / sd_clock_khz;

        /* choose slower clock if system clock cannot divisible by wanted clock */
        if ((_SDH0_ReferenceClock % sd_clock_khz) != 0ul)
        {
            rate++;
        }
    }
    else
    {
        rate = _SDH1_ReferenceClock / sd_clock_khz;

        /* choose slower clock if system clock cannot divisible by wanted clock */
        if ((_SDH1_ReferenceClock % sd_clock_khz) != 0ul)
        {
            rate++;
        }
    }

    if (rate >= SDH_CLK_DIV0_MAX)
    {
        rate = SDH_CLK_DIV0_MAX;
    }

    /*--- calculate the second divider CLKDIV0[SDHOST_N]*/
    div1 = (rate - 1ul) & 0xFFul;

    /*--- setup register */
    if (sdh == SDH0)
    {
        CLK->SDHDIV &= ~CLK_SDHDIV_SDH0DIV_Msk;
        CLK->SDHDIV |= (div1 << CLK_SDHDIV_SDH0DIV_Pos);
    }
    else
    {
        CLK->SDHDIV &= ~CLK_SDHDIV_SDH1DIV_Msk;
        CLK->SDHDIV |= (div1 << CLK_SDHDIV_SDH1DIV_Pos);
    }

    if (u32RegLockLevel)
    {
        SYS_LockReg();
    }

    return;
}

uint32_t SDH_CardDetection(SDH_T *sdh)
{
    uint32_t i, val = TRUE;
    SDH_INFO_T *pSD;

    if (sdh == SDH0)
    {
        pSD = &SD0;
    }
    else
    {
        pSD = &SD1;
    }


